In [2]:
#Devesh Bhogre 1032170730 Panel 2

In [3]:
import numpy as np
import pandas as pd

In [4]:
df = pd.read_csv("C:\\Users\\Devesh Bhogre\\Desktop\\Programs\\Python\\classes\\IMLA\\Practice\\Emp.csv")

In [5]:
df.head(2)

   empno       ename    job        DOJ        DOB  deptid   salary
0      1        Anil  Clerk        NaN        NaN     NaN      NaN
1      2  Balkrushna    NaN  15-Jul-17  16-Mar-12    10.0  10000.0

In [6]:
df.tail(2)

    empno   ename         job        DOJ        DOB  deptid   salary
9      10   Sakhi  Accountant  23-Mar-12  14-Mar-91    30.0  46000.0
10     11  Soniya  Accountant  24-Mar-14  24-Mar-91    30.0  47000.0

In [7]:
df.columns

Index(['empno', 'ename', 'job', 'DOJ', 'DOB', 'deptid', 'salary'], dtype='object')

In [8]:
df.describe() #statical summary for only numerical columns only

           empno     deptid        salary
count  11.000000   9.000000      9.000000
mean    6.000000  21.111111  41333.333333
std     3.316625   6.009252  15329.709717
min     1.000000  10.000000  10000.000000
25%     3.500000  20.000000  45000.000000
50%     6.000000  20.000000  46000.000000
75%     8.500000  20.000000  50000.000000
max    11.000000  30.000000  56000.000000

In [9]:
df["salary"].max()

56000.0

In [10]:
df.dropna()

    empno   ename         job        DOJ        DOB  deptid   salary
2       3  Mathew     Manager  16-Mar-12  16-Mar-92    20.0  50000.0
4       5   Vimal  Accountant  18-Mar-17  18-Mar-91    20.0  45000.0
5       6   Kamal  Accountant  19-Nov-13  18-Mar-91    20.0  45000.0
6       7   Nanda     Manager  20-Mar-12  20-Jan-97    20.0  52000.0
7       8  Khushi     Manager  21-Mar-12  21-Jun-94    20.0  56000.0
9      10   Sakhi  Accountant  23-Mar-12  14-Mar-91    30.0  46000.0
10     11  Soniya  Accountant  24-Mar-14  24-Mar-91    30.0  47000.0

In [11]:
df.head().mean() #mean of first 5

empno         3.0
deptid       17.5
salary    35000.0
dtype: float64

In [12]:
df[["ename"]]

         ename
0         Anil
1   Balkrushna
2       Mathew
3        Suhas
4        Vimal
5        Kamal
6        Nanda
7       Khushi
8        Sayee
9        Sakhi
10      Soniya

In [13]:
df.ename

0           Anil
1     Balkrushna
2         Mathew
3          Suhas
4          Vimal
5          Kamal
6          Nanda
7         Khushi
8          Sayee
9          Sakhi
10        Soniya
Name: ename, dtype: object

In [14]:
df.salary.count()

9

In [15]:
df.salary.mean()

41333.333333333336

In [16]:
df_job = df.groupby(['job'])
df_job.mean()

            empno  deptid        salary
job
Accountant    8.0    25.0  45750.000000
Cleark        9.0     NaN  21000.000000
Clerk         1.0     NaN           NaN
Manager       5.5    20.0  52666.666667

In [17]:
df.groupby('job')[['salary']].mean()

                  salary
job
Accountant  45750.000000
Cleark      21000.000000
Clerk                NaN
Manager     52666.666667

In [18]:
df_more = df[df['salary']>10000]
df_more

    empno   ename         job        DOJ        DOB  deptid   salary
2       3  Mathew     Manager  16-Mar-12  16-Mar-92    20.0  50000.0
4       5   Vimal  Accountant  18-Mar-17  18-Mar-91    20.0  45000.0
5       6   Kamal  Accountant  19-Nov-13  18-Mar-91    20.0  45000.0
6       7   Nanda     Manager  20-Mar-12  20-Jan-97    20.0  52000.0
7       8  Khushi     Manager  21-Mar-12  21-Jun-94    20.0  56000.0
8       9   Sayee      Cleark  16-Mar-12  22-Aug-98     NaN  21000.0
9      10   Sakhi  Accountant  23-Mar-12  14-Mar-91    30.0  46000.0
10     11  Soniya  Accountant  24-Mar-14  24-Mar-91    30.0  47000.0

In [19]:
df_less_cleark = df[(df['salary']<30000) & (df['job']=='Cleark')]
df_less_cleark.ename

8    Sayee
Name: ename, dtype: object

In [20]:
df.loc[5:10,("ename","job")]

     ename         job
5    Kamal  Accountant
6    Nanda     Manager
7   Khushi     Manager
8    Sayee      Cleark
9    Sakhi  Accountant
10  Soniya  Accountant

In [21]:
df.iloc[5:10,[0,1,2]]

   empno   ename         job
5      6   Kamal  Accountant
6      7   Nanda     Manager
7      8  Khushi     Manager
8      9   Sayee      Cleark
9     10   Sakhi  Accountant

In [22]:
df.iloc[:,-1] #last column

0         NaN
1     10000.0
2     50000.0
3         NaN
4     45000.0
5     45000.0
6     52000.0
7     56000.0
8     21000.0
9     46000.0
10    47000.0
Name: salary, dtype: float64

In [23]:
df.iloc[-1] #last row

empno             11
ename         Soniya
job       Accountant
DOJ        24-Mar-14
DOB        24-Mar-91
deptid            30
salary         47000
Name: 10, dtype: object

In [24]:
df_sorted = df.sort_values(by = 'job')
df_sorted

    empno       ename         job        DOJ        DOB  deptid   salary
4       5       Vimal  Accountant  18-Mar-17  18-Mar-91    20.0  45000.0
5       6       Kamal  Accountant  19-Nov-13  18-Mar-91    20.0  45000.0
9      10       Sakhi  Accountant  23-Mar-12  14-Mar-91    30.0  46000.0
10     11      Soniya  Accountant  24-Mar-14  24-Mar-91    30.0  47000.0
8       9       Sayee      Cleark  16-Mar-12  22-Aug-98     NaN  21000.0
0       1        Anil       Clerk        NaN        NaN     NaN      NaN
2       3      Mathew     Manager  16-Mar-12  16-Mar-92    20.0  50000.0
3       4       Suhas     Manager  16-Mar-12  17-Mar-91    20.0      NaN
6       7       Nanda     Manager  20-Mar-12  20-Jan-97    20.0  52000.0
7       8      Khushi     Manager  21-Mar-12  21-Jun-94    20.0  56000.0
1       2  Balkrushna         NaN  15-Jul-17  16-Mar-12    10.0  10000.0